openthread/openthread/third_party/ti/devices/cc26x0/inc/hw_flash.h
// Field: [17:16] PGM_SUBMODE
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_MODE_PGM_SUBMODE_W                                         2
#define FLASH_FSM_MODE_PGM_SUBMODE_M                                0x00030000
#define FLASH_FSM_MODE_PGM_SUBMODE_S                                        16

// Field: [15:14] ERA_SUBMODE
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_MODE_ERA_SUBMODE_W                                         2
#define FLASH_FSM_MODE_ERA_SUBMODE_M                                0x0000C000
#define FLASH_FSM_MODE_ERA_SUBMODE_S                                        14

// Field: [13:12] SUBMODE
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_MODE_SUBMODE_W                                             2
#define FLASH_FSM_MODE_SUBMODE_M                                    0x00003000
#define FLASH_FSM_MODE_SUBMODE_S                                            12

// Field:  [11:9] SAV_PGM_CMD
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_MODE_SAV_PGM_CMD_W                                         3
#define FLASH_FSM_MODE_SAV_PGM_CMD_M                                0x00000E00
#define FLASH_FSM_MODE_SAV_PGM_CMD_S                                         9

// Field:   [8:6] SAV_ERA_MODE
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_MODE_SAV_ERA_MODE_W                                        3
#define FLASH_FSM_MODE_SAV_ERA_MODE_M                               0x000001C0
#define FLASH_FSM_MODE_SAV_ERA_MODE_S                                        6

// Field:   [5:3] MODE
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_MODE_MODE_W                                                3
#define FLASH_FSM_MODE_MODE_M                                       0x00000038
#define FLASH_FSM_MODE_MODE_S                                                3

// Field:   [2:0] CMD
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_MODE_CMD_W                                                 3
#define FLASH_FSM_MODE_CMD_M                                        0x00000007
#define FLASH_FSM_MODE_CMD_S                                                 0

//*****************************************************************************
//
// Register: FLASH_O_FSM_PGM
//
//*****************************************************************************
// Field: [25:23] PGM_BANK
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_PGM_PGM_BANK_W                                             3
#define FLASH_FSM_PGM_PGM_BANK_M                                    0x03800000
#define FLASH_FSM_PGM_PGM_BANK_S                                            23

// Field:  [22:0] PGM_ADDR
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_PGM_PGM_ADDR_W                                            23
#define FLASH_FSM_PGM_PGM_ADDR_M                                    0x007FFFFF
#define FLASH_FSM_PGM_PGM_ADDR_S                                             0

//*****************************************************************************
//
// Register: FLASH_O_FSM_ERA
//
//*****************************************************************************
// Field: [25:23] ERA_BANK
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_ERA_ERA_BANK_W                                             3
#define FLASH_FSM_ERA_ERA_BANK_M                                    0x03800000
#define FLASH_FSM_ERA_ERA_BANK_S                                            23

// Field:  [22:0] ERA_ADDR
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_ERA_ERA_ADDR_W                                            23
#define FLASH_FSM_ERA_ERA_ADDR_M                                    0x007FFFFF
#define FLASH_FSM_ERA_ERA_ADDR_S                                             0

//*****************************************************************************
//
// Register: FLASH_O_FSM_PRG_PUL
//
//*****************************************************************************
// Field: [19:16] BEG_EC_LEVEL
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_PRG_PUL_BEG_EC_LEVEL_W                                     4
#define FLASH_FSM_PRG_PUL_BEG_EC_LEVEL_M                            0x000F0000
#define FLASH_FSM_PRG_PUL_BEG_EC_LEVEL_S                                    16

// Field:  [11:0] MAX_PRG_PUL
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_PRG_PUL_MAX_PRG_PUL_W                                     12
#define FLASH_FSM_PRG_PUL_MAX_PRG_PUL_M                             0x00000FFF
#define FLASH_FSM_PRG_PUL_MAX_PRG_PUL_S                                      0

//*****************************************************************************
//
// Register: FLASH_O_FSM_ERA_PUL
//
//*****************************************************************************
// Field: [19:16] MAX_EC_LEVEL
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_ERA_PUL_MAX_EC_LEVEL_W                                     4
#define FLASH_FSM_ERA_PUL_MAX_EC_LEVEL_M                            0x000F0000
#define FLASH_FSM_ERA_PUL_MAX_EC_LEVEL_S                                    16

// Field:  [11:0] MAX_ERA_PUL
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_ERA_PUL_MAX_ERA_PUL_W                                     12
#define FLASH_FSM_ERA_PUL_MAX_ERA_PUL_M                             0x00000FFF
#define FLASH_FSM_ERA_PUL_MAX_ERA_PUL_S                                      0

//*****************************************************************************
//
// Register: FLASH_O_FSM_STEP_SIZE
//
//*****************************************************************************
// Field: [24:16] EC_STEP_SIZE
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_STEP_SIZE_EC_STEP_SIZE_W                                   9
#define FLASH_FSM_STEP_SIZE_EC_STEP_SIZE_M                          0x01FF0000
#define FLASH_FSM_STEP_SIZE_EC_STEP_SIZE_S                                  16

//*****************************************************************************
//
// Register: FLASH_O_FSM_PUL_CNTR
//
//*****************************************************************************
// Field: [24:16] CUR_EC_LEVEL
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_PUL_CNTR_CUR_EC_LEVEL_W                                    9
#define FLASH_FSM_PUL_CNTR_CUR_EC_LEVEL_M                           0x01FF0000
#define FLASH_FSM_PUL_CNTR_CUR_EC_LEVEL_S                                   16

// Field:  [11:0] PUL_CNTR
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_PUL_CNTR_PUL_CNTR_W                                       12
#define FLASH_FSM_PUL_CNTR_PUL_CNTR_M                               0x00000FFF
#define FLASH_FSM_PUL_CNTR_PUL_CNTR_S                                        0

//*****************************************************************************
//
// Register: FLASH_O_FSM_EC_STEP_HEIGHT
//
//*****************************************************************************
// Field:   [3:0] EC_STEP_HEIGHT
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_EC_STEP_HEIGHT_EC_STEP_HEIGHT_W                            4
#define FLASH_FSM_EC_STEP_HEIGHT_EC_STEP_HEIGHT_M                   0x0000000F
#define FLASH_FSM_EC_STEP_HEIGHT_EC_STEP_HEIGHT_S                            0

//*****************************************************************************
//
// Register: FLASH_O_FSM_ST_MACHINE
//
//*****************************************************************************
// Field:    [23] DO_PRECOND
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_ST_MACHINE_DO_PRECOND                             0x00800000
#define FLASH_FSM_ST_MACHINE_DO_PRECOND_BITN                                23
#define FLASH_FSM_ST_MACHINE_DO_PRECOND_M                           0x00800000
#define FLASH_FSM_ST_MACHINE_DO_PRECOND_S                                   23

// Field:    [22] FSM_INT_EN
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_ST_MACHINE_FSM_INT_EN                             0x00400000
#define FLASH_FSM_ST_MACHINE_FSM_INT_EN_BITN                                22
#define FLASH_FSM_ST_MACHINE_FSM_INT_EN_M                           0x00400000
#define FLASH_FSM_ST_MACHINE_FSM_INT_EN_S                                   22

